In [12]:
import numpy as np
import pandas as pd

In [15]:
stuff = {
    'Corporation': ['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    'Employees': ['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary': [200, 220, 190, 130, 120, 150]
}
df = pd.DataFrame(stuff)
df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [13]:
# group by helps to group the entire data by a name almost similar to index but the entire data can be manipulate according to Item
# Group by used when there is frequent value

In [24]:
corp= df.groupby('Corporation')
corp

In [17]:
# it will give a object referance that can be manipulated later

In [29]:
corp.mean(numeric_only=True)

             Salary
Corporation
Apple         165.0
Google        170.0
Meta          170.0

In [30]:
corp.std(numeric_only=True)

                Salary
Corporation
Apple        49.497475
Google       70.710678
Meta         28.284271